## Multilevel index or Index hierarchy

In [10]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [14]:
outside = ['G1', 'G1', 'G1','G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [15]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [16]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1  1.327203  0.026778
   2  0.795649  0.398815
   3 -0.556364  0.333390
G2 1 -0.170463 -2.154410
   2  1.950914  1.165413
   3  1.105854  0.816913

In [17]:
df.loc['G1']

          A         B
1  1.327203  0.026778
2  0.795649  0.398815
3 -0.556364  0.333390

## Putting the oustside and inside index name

In [18]:
df.index.names = ['Group', 'Number']

In [19]:
df

                     A         B
Group Number
G1    1       1.327203  0.026778
      2       0.795649  0.398815
      3      -0.556364  0.333390
G2    1      -0.170463 -2.154410
      2       1.950914  1.165413
      3       1.105854  0.816913

In [24]:
df.loc['G2'].iloc[1, 1]    #using iloc

1.1654132171971612

In [27]:
df.loc['G2'].loc[2, 'B']    # using loc

1.1654132171971612

In [30]:
df

                     A         B
Group Number
G1    1       1.327203  0.026778
      2       0.795649  0.398815
      3      -0.556364  0.333390
G2    1      -0.170463 -2.154410
      2       1.950914  1.165413
      3       1.105854  0.816913

In [29]:
df.xs('G1')   # using cross section function grabbing the G1 values

               A         B
Number
1       1.327203  0.026778
2       0.795649  0.398815
3      -0.556364  0.333390

Now I want to grab row 1 from G1 and G2 respectively

In [31]:
df.xs(1, level="Number")

              A         B
Group
G1     1.327203  0.026778
G2    -0.170463 -2.154410

In [33]:
df

                     A         B
Group Number
G1    1       1.327203  0.026778
      2       0.795649  0.398815
      3      -0.556364  0.333390
G2    1      -0.170463 -2.154410
      2       1.950914  1.165413
      3       1.105854  0.816913

Now I want grab row 2 from G1 & G2 repectively

In [32]:
df.xs(2, level="Number")

              A         B
Group
G1     0.795649  0.398815
G2     1.950914  1.165413